In [1]:
# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# ------------------------------------------------------------------------------
from scipy.stats import shapiro, kstest

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv("raw_data.csv") # index_col=0 se quita, no hay indice

In [3]:
# FALTA - limpiar/sacar informacion de `roledepartment` porque está destinada a eliminación

**Transformamos: quitamos $ y cambiamos "," por "."**

`sameasmonthlyincome`, `salary`, `monthlyincome`, `monthlyrate`, `performancerating`, `worklifebalance`, `totalworkingyears`, `yearsincurrentrole`

In [4]:
lista_errores = []

def cambiar_comas(dato):
    try:
        # Primero quitamos el símbolo $, luego cambiamos coma por punto
        dato_limpio = dato.replace("$", "").replace(",", ".")
        return float(dato_limpio)
    except:
        lista_errores.append(dato)
        return np.nan

In [5]:
lista_col = ["sameasmonthlyincome",  "salary", "monthlyincome", "monthlyrate", "performancerating", "worklifebalance", "totalworkingyears", "yearsincurrentrole"]

In [6]:
for col in lista_col:
    print(col)
    df[col] = df[col].apply(cambiar_comas)

sameasmonthlyincome
salary
monthlyincome
monthlyrate
performancerating
worklifebalance
totalworkingyears
yearsincurrentrole

In [7]:
df[["sameasmonthlyincome",  "salary", "monthlyincome", "monthlyrate", "performancerating", "worklifebalance", "totalworkingyears", "yearsincurrentrole"]]

,sameasmonthlyincome,salary,monthlyincome,monthlyrate,performancerating,worklifebalance,totalworkingyears,yearsincurrentrole
0,16280.83,195370.00,16280.83,42330.17,3.0,3.0,NaN,NaN
1,NaN,199990.00,NaN,43331.17,3.0,3.0,34.0,NaN
2,NaN,192320.00,NaN,41669.33,3.0,NaN,22.0,NaN
3,14307.50,171690.00,14307.50,37199.50,3.0,NaN,NaN,NaN
4,12783.92,NaN,12783.92,33238.20,3.0,3.0,NaN,NaN
...,...,...,...,...,...,...,...,...
1673,3949.17,NaN,3949.17,10267.83,3.0,3.0,NaN,NaN
1674,15943.72,191324.62,15943.72,41453.67,3.0,3.0,27.0,NaN
1675,NaN,28111.13,NaN,6090.75,3.0,3.0,6.0,NaN
1676,8339.32,100071.84,8339.32,21682.23,NaN,3.0,NaN,NaN
1677,NaN,53914.11,NaN,11681.39,3.0,3.0,10.0,NaN

**Transformamos: redondeamos a 2 decimales `hourlyrate`, `dailyrate`**

In [8]:
def redondear_dos_decimales(valor):
    try:
        return round(float(valor), 2)
    except:
        return np.nan

In [9]:
columnas_a_redondear = ["hourlyrate", "dailyrate"]

In [10]:
for col in columnas_a_redondear:
    print(col)
    df[col] = df[col].apply(redondear_dos_decimales)

hourlyrate
dailyrate

In [11]:
df[["dailyrate", "hourlyrate"]]

      dailyrate  hourlyrate
0       2015.72         NaN
1       2063.39         NaN
2       1984.25         NaN
3       1771.40         NaN
4       1582.77         NaN
...         ...         ...
1673     488.94         NaN
1674    1973.98         NaN
1675     290.04         NaN
1676    1032.49         NaN
1677     556.26       69.53

[1678 rows x 2 columns]

**Rellenar Rates que tienen NaN `hourlyrate` - lo que se cobra al cliente, `salary`, `montlyincome` - lo que gana el trabajador**

In [12]:
df["monthlyrate"].isnull().sum()

np.int64(0)

In [13]:
df["monthlyrate"].unique()

array([42330.17, 43331.17, 41669.33, 37199.5 , 33238.2 , 37210.33,
       21682.23, 11681.39, 35955.83, 41453.67, 43274.83, 29037.67,
       28613.  , 42347.5 , 39088.83, 41699.67, 23287.33, 36296.  ,
       13435.5 , 42997.5 ,  8668.83, 22635.17, 34805.33,  6955.  ,
       22243.  , 22695.83, 13351.  , 10228.83,  6090.75,  9999.17,
       36744.5 , 22329.67, 11713.  , 12787.67, 23519.17, 12813.67,
       14399.67, 30274.83, 28860.  , 14488.5 , 10259.17, 30056.  ,
       41264.17, 34699.17, 20828.17, 24938.33,  9329.67, 36933.  ,
       10978.5 ,  7999.33, 43001.83,  5000.67, 12451.83, 22581.  ,
       13751.83,  5087.33,  6656.  , 27061.67, 17376.67, 36980.67,
       19376.5 , 41756.  , 12083.5 ,  5830.5 , 16039.83, 19116.5 ,
        7754.5 , 38521.17, 39461.5 , 29416.83, 41578.33, 37099.83,
       41571.83, 21684.  , 17307.33, 15346.5 , 10233.17,  7381.83,
        6346.17, 26067.17, 33425.17, 11106.33, 20841.17, 10855.  ,
       41238.17, 22533.33,  6051.5 , 12293.67, 41593.5 , 18226.  ,
        7254.  , 11502.83, 16583.67, 27750.67, 14269.67,  5457.83,
       37047.83, 28426.67,  6783.83,  9628.67, 14460.33, 21346.  ,
       38698.83, 16133.  , 29806.83, 35962.33,  9284.17, 21935.33,
       21047.  , 21502.  , 24364.17,  6649.5 , 20022.17, 14022.67,
        6619.17, 18028.83,  6809.83, 18585.67,  9093.5 , 21424.  ,
       28905.5 , 12300.17,  6302.83, 20639.67, 14787.5 ,  9585.33,
       11788.83, 13160.33, 13316.33, 13372.67, 10114.  , 12144.17,
        9357.83,  7722.  , 13565.5 , 14742.  , 42111.33, 12627.33,
        5319.17, 10952.5 , 10144.33, 11390.17,  4591.17, 12943.67,
        6573.67, 28626.  , 18182.67,  8777.17, 10410.83,  5938.83,
       11563.5 , 20440.33, 11691.33, 24177.83, 10746.67, 19051.5 ,
       41576.17,  4801.33, 25378.17, 11492.  , 24056.5 , 14369.33,
       16438.5 ,  9392.5 , 12956.67,  9195.33, 11327.33,  5850.  ,
        5126.33,  5046.17,  9303.67, 14570.83, 22370.83,  9635.17,
       23497.5 , 11856.  , 13834.17, 16304.17,  7930.  , 18936.67,
       29247.83,  7563.83, 11310.  , 22212.67, 42770.  , 13452.83,
       15370.33,  9823.67, 18416.67, 10051.17, 11619.83,  8842.17,
        7752.33, 37544.  , 23384.83, 23510.5 , 22676.33,  5117.67,
       13951.17, 12499.5 ,  9500.83,  8809.67, 11279.67,  5752.5 ,
        5568.33,  9754.33, 10764.  , 11151.83,  5889.  ,  7667.83,
       11847.33, 12594.83, 20945.17, 11167.  , 12295.83, 15847.  ,
       11045.67, 29401.67, 14542.67, 21647.17, 22204.  , 23699.  ,
        5618.17, 25735.67, 17539.17, 36521.33,  9830.17, 38835.33,
        8697.  , 27607.67,  7314.67, 22711.  ,  9206.17, 14189.5 ,
       31223.83, 42436.33, 17846.83,  6957.17, 36192.  , 10343.67,
        9897.33, 12984.83, 14081.17,  7479.33, 13860.17,  5904.17,
        7847.67, 13390.  , 13593.67,  9492.17,  5544.5 , 11890.67,
        5447.  ,  6924.67,  7410.  ,  8855.17, 11630.67, 28028.  ,
        9145.5 , 10753.17,  9100.  , 10846.33, 16551.17, 14087.67,
       29304.17, 13756.17, 13823.33,  6721.  ,  9871.33,  9165.  ,
       10527.83, 13697.67, 23315.5 ,  6441.5 , 11275.33, 37697.83,
       36584.17,  9366.5 , 11169.17,  6361.33, 40709.5 , 10579.83,
        4396.17,  6491.33, 20102.33,  9017.67, 19181.5 , 10564.67,
        4638.83, 16804.67,  8528.  , 14824.33,  8642.83, 10681.67,
        8021.  ,  5860.83,  9637.33,  5154.5 , 11888.5 ,  6088.33,
       19365.67, 21528.  , 11817.  , 40603.33, 11858.17, 29256.5 ,
       29356.17, 39372.67,  6010.33, 20451.17, 11407.5 ,  8265.83,
        5176.17,  8666.67, 38098.67, 12265.5 , 10549.5 , 10072.83,
       22741.33,  5997.33,  7384.  ,  8135.83,  4738.5 ,  9225.67,
       11539.67, 11884.17,  6027.67, 38217.83, 13134.33, 13624.  ,
        7418.67,  9087.  ,  5486.  , 12276.33, 29739.67,  8898.5 ,
        7793.5 ,  8915.83, 13589.33,  5453.5 ,  8458.67, 19942.  ,
        9474.83,  4472.  ,  5265.  , 10566.83,  8146.67,  4361.5 ,
        6443.67,  5993.  ,  7316.83,  9128.17, 14111.5 ,  9282.  ,
        4823.  , 12048.83,  4645.33, 11641.5 ,  6276.83, 11528.83,
       11721.67, 10508.33,  4335.5 ,  9542.  ,  8545.33,  6413.33,
       41051.83, 14007.5 ,  5813.17,  4363.67,  7455.5 , 29605.33,
       10878.83, 40828.67, 10267.83, 23075.  ,  9353.5 ,  4385.33,
        6625.67,  8512.83,  9587.5 ,  5044.  ,  5756.83, 12870.  ,
        5681.  ,  6959.33,  6307.17, 15017.17,  4714.67,  6998.33,
       40440.83,  6042.83, 13888.33, 10705.5 ,  8629.83,  6292.  ,
        5841.33,  4710.33, 14635.83, 23757.5 ,  5509.83, 42046.33,
       14165.67,  4892.33,  4805.67,  5750.33, 25859.17,  5516.33,
        8437.  ,  9234.33, 22808.5 ,  5200.  ,  7975.5 ,  7468.5 ,
       42278.17,  5761.17, 19168.5 ,  4430.83, 10510.5 , 17593.33,
        9916.83, 11710.83,  8034.  , 29835.  ,  4976.83,  5308.33,
        9407.67,  5572.67, 14083.33,  6822.83, 11535.33,  9494.33,
        5531.5 , 12854.83,  9539.83, 23690.33,  4381.  ,  9221.33,
        7756.67,  6281.17, 12051.  ,  5150.17,  5208.67,  6064.5 ,
        6090.5 ,  9483.5 ,  9186.67,  9158.5 ,  8486.83, 10766.17,
        4424.33,  6112.17, 21573.5 ,  4781.83,  4485.  ,  6047.17,
       17818.67,  5655.  , 12417.17,  5501.17,  5148.  , 41342.17,
        5943.17,  9832.33,  8378.5 ,  4506.67,  4541.33, 10025.17,
        4987.67, 10987.17, 22958.  , 11845.17,  5187.  ,  7862.83,
       20284.33,  6996.17, 35581.  , 12235.17,  9533.33,  4476.33,
       11886.33,  6851.  , 14410.5 , 10612.33,  6890.  , 24362.  ,
        8816.17, 13849.33, 10519.17,  7176.  ,  6753.5 , 32937.67,
        5590.  ,  4693.  ,  9477.  , 11927.5 ,  5605.17, 34606.  ,
        4994.17,  7438.17,  7533.5 ,  8465.17,  7464.17,  5980.  ,
       13637.  , 28418.  ,  7780.5 ,  4560.83,  8454.33,  5767.67,
        4467.67, 11931.83, 17556.5 ,  8619.  , 11697.83, 22637.33,
        9620.  ,  5763.33,  7312.5 ,  4916.17, 10371.83,  6086.17,
       23517.  ,  5570.5 , 13307.67,  5408.  ,  7407.83,  5418.83,
        5559.67,  8493.33, 30255.33, 14170.  ,  4862.  , 35065.33,
        9171.5 , 32097.  , 37177.83,  5022.33,  7836.83,  5815.33,
       41680.17,  9581.  ,  5529.33,  5802.33, 11203.83, 25818.  ,
       20323.33, 12735.67,  5347.33,  8941.83,  4654.  ,  8419.67,
       14445.17,  4528.33,  4519.67,  4227.17,  6547.67, 21068.67,
        7340.67,  6582.33,  5031.  ,  6339.67,  9760.83,  6142.5 ,
       14198.17, 14458.17, 29447.17,  4716.83, 42286.83, 41604.33,
       21770.67,  5899.83, 14395.33,  6848.83,  3076.67,  2600.  ,
       11349.  , 21634.17, 34649.33,  5135.  , 14692.17, 14414.83,
        6177.17, 11392.33,  5364.67,  4950.83,  7470.67,  9875.67,
        3687.67,  5555.33, 10985.  ,  8190.  , 21285.33,  4069.  ,
        5070.  ,  4608.5 ,  4404.83, 20804.33, 36025.17,  4513.17,
        2186.17, 17032.17,  5724.33, 11095.5 ,  5837.  , 11037.  ,
        4927.  ,  5013.67,  5156.67,  4350.67, 22862.67,  4894.5 ,
        5228.17,  4595.5 ,  5371.17, 28587.  ,  9019.83,  5633.33,
       39656.5 , 10350.17,  2279.33,  5332.17,  5624.67, 10244.  ,
       15927.17, 10326.33,  6125.17,  6181.5 ,  4961.67,  4565.17,
        4788.33, 28580.5 , 39574.17,  2422.33,  5139.33,  6149.  ,
       39132.17,  3490.5 , 10330.67,  2760.33,  5548.83,  3386.5 ,
       13840.67, 18148.  , 10488.83,  4493.67,  6439.33, 14765.83,
        5828.33, 38061.83,  3399.5 ,  9071.83,  7163.  ,  3018.17,
       23579.83,  6201.  , 14592.5 , 21138.  , 11470.33,  5280.17,
        8820.5 ,  6404.67, 10070.67,  6075.33,  5284.5 ,  6188.  ,
        6354.83,  2363.83, 11160.5 ,  6203.17,  6192.33,  2446.17,
       42100.5 ])

In [14]:
df["monthlyincome"].isnull().sum()

np.int64(489)

In [15]:
df["salary"].isnull().sum()

np.int64(285)

In [16]:
df.shape

(1678, 42)

In [17]:
df[["hourlyrate","dailyrate", "monthlyrate", "salary", "monthlyincome"]].sample(20)

      hourlyrate  dailyrate  monthlyrate     salary  monthlyincome
1231       36.25     290.04      6090.75   28111.13        2342.59
32        246.75    1973.98     41453.67  191324.62       15943.72
388       197.85    1582.77     33238.20  153407.07       12783.92
1246         NaN    1032.49     21682.23        NaN        8339.32
761          NaN     290.04      6090.75   28111.13        2342.59
132          NaN     290.04      6090.75   28111.13        2342.59
327          NaN     556.26     11681.39   53914.11            NaN
921          NaN    2013.25     42278.17        NaN       16260.83
54           NaN     556.26     11681.39        NaN        4492.84
320          NaN     865.84     18182.67   83920.00            NaN
1001         NaN     287.96      6047.17   27910.00            NaN
1090         NaN     556.26     11681.39   53914.11            NaN
1009      246.75    1973.98     41453.67  191324.62       15943.72
69         86.24     689.93     14488.50   66870.00        5572.50
425          NaN     556.26     11681.39   53914.11        4492.84
752          NaN     212.95      4472.00   20640.00        1720.00
37           NaN     331.19      6955.00   32100.00        2675.00
1205         NaN     290.04      6090.75   28111.13            NaN
26           NaN    2047.50     42997.50  198450.00            NaN
106       134.41    1075.29     22581.00  104220.00        8685.00

**Transformamos: modificamos columnas a minuscula**

`"department`, `educationfield`, `attrition`, `jobrole`, `maritalstatus`, `over18`, `overtime`, `standardhours`, `roledepartament`, `remotework`

In [18]:
cambios_a_minuscula = ["department", "educationfield", "attrition", "jobrole", "maritalstatus", "over18", "overtime", "standardhours", "roledepartament", "remotework"]

In [19]:
for col in cambios_a_minuscula:
    df[col] = df[col].apply(lambda dato: dato.lower() if type(dato) == str else dato)

In [20]:
df[["department", "educationfield", "attrition", "jobrole", "maritalstatus", "over18", "overtime", "standardhours", "roledepartament", "remotework"]]

,department,educationfield,attrition,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,NaN,NaN,no,research director,NaN,y,no,full time,NaN,yes
1,NaN,life sciences,no,manager,NaN,NaN,NaN,NaN,NaN,1
2,research & development,technical degree,no,manager,married,NaN,no,NaN,manager - research & development,1
3,NaN,medical,no,research director,married,y,NaN,full time,NaN,false
4,NaN,technical degree,no,sales executive,divorced,y,no,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...
1673,NaN,medical,no,research scientist,single,NaN,NaN,NaN,NaN,yes
1674,NaN,NaN,no,manager,married,y,no,full time,NaN,false
1675,NaN,NaN,no,research scientist,NaN,NaN,no,part time,NaN,false
1676,NaN,life sciences,no,manufacturing director,divorced,NaN,yes,part time,NaN,yes
1677,NaN,life sciences,no,research scientist,single,y,yes,part time,NaN,0

**Transformamos: columna `maritalstatus` 1 dato mal escritos**

In [21]:
df["maritalstatus"] = df["maritalstatus"].replace("marreid", "married")

In [22]:
df["maritalstatus"].value_counts()

maritalstatus
married     455
single      343
divorced    205
Name: count, dtype: int64

**Transformamos: valores NaN por 'non-travel' en columna ``businesstravel`` basados en la información que nos ha proporcionado nuestro enlace con el proyecto**

In [23]:
df["businesstravel"] = df["businesstravel"].fillna("non-travel")

In [24]:
df['businesstravel'].value_counts()

businesstravel
non-travel           894
travel_rarely        616
travel_frequently    168
Name: count, dtype: int64

**Transformamos: espaciado sobrante en valores de la columna ``department``, ``jobrole`` y ``educationfield``**

In [25]:
print(df['department'].unique())
print('-------------')
print(df['jobrole'].unique())
print(df['educationfield'].unique())

[nan ' research & development ' ' sales ' ' human resources ']
-------------
[' research director ' ' manager ' ' sales executive '
 ' manufacturing director ' ' research scientist '
 ' healthcare representative ' ' laboratory technician '
 ' sales representative ' ' human resources ']
[nan 'life sciences' 'technical degree' 'medical' 'other' 'marketing'
 'human resources']

In [26]:
def sin_espaciado_extra(series):
    return series.str.strip().str.replace(r'\s+', ' ', regex=True)

columnas_a_limpiar = ['department', 'jobrole', 'educationfield']  # Ejemplo de columnas

for c in columnas_a_limpiar:

    if c in df.columns:  
        df[c] = sin_espaciado_extra(df[c])

In [27]:
print(df['department'].unique())
print('-------------')
print(df['jobrole'].unique())
print('-------------')
print(df['educationfield'].unique())

# no nos hace falta limpiar 'roledepartment' porque está destinada a eliminación

[nan 'research & development' 'sales' 'human resources']
-------------
['research director' 'manager' 'sales executive' 'manufacturing director'
 'research scientist' 'healthcare representative' 'laboratory technician'
 'sales representative' 'human resources']
-------------
[nan 'life sciences' 'technical degree' 'medical' 'other' 'marketing'
 'human resources']

**DROP Columns - `employeecount`, `sameasmonthlyincome`,`numberchildren`, `over18`, `yearsincurrentrole`**

In [28]:
df = df.drop(['employeecount', 'sameasmonthlyincome', 'numberchildren', 'over18', 'yearsincurrentrole'], axis=1)

In [29]:
df.head(2)

,Unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,datebirth,salary,roledepartament,remotework
0,0,51,no,non-travel,2015.72,NaN,6,3,NaN,1,1,0,NaN,3,5,research director,3,NaN,16280.83,42330.17,7,no,13,3.0,3,full time,0,NaN,5,3.0,20,15,15,1972,195370.0,NaN,yes
1,1,52,no,non-travel,2063.39,NaN,1,4,life sciences,2,3,0,NaN,2,5,manager,3,NaN,NaN,43331.17,0,NaN,14,3.0,1,NaN,1,34.0,5,3.0,33,11,9,1971,199990.0,NaN,1

KEEP en BBDD pero no en CSV: 
- numberchildren (todos nan, pero puede ser interesante para la empresa en el futuro)

**DROP Duplicate Rows - `employeenumber` - keep first, reset index**

Duplicados borrados, quardamos solo el primero, reset indice del df.

In [30]:
df = df.drop_duplicates(subset='employeenumber', keep='first').reset_index(drop=True)

In [31]:
df['employeenumber'].duplicated().any()

np.False_

**REPLACE `genders` - 0 = m, 1 = f**

In [32]:
df['gender'] = df['gender'].replace({0: 'm', 1: 'f'})

**REPLACE `maritalstatus`, `overtime` - NaN por "unknown"**

In [33]:
df['maritalstatus'].isna().sum()

np.int64(651)

In [34]:
df = df.fillna({'maritalstatus': 'unknown', 'overtime': 'unknown'})

**FILLNA `standardhours` - NaN = full time (dice Pili)**

In [35]:
df['standardhours'] = df['standardhours'].fillna('full time')

**GUARDAR datos limpios a .csv nuevo "raw_data_limpio.csv"**

In [36]:
df.to_csv("raw_data_limpio_3.csv", index=False)

In [ ]:
df.shape
# raw_data.csv original: 1678 rows, 41 columns
# raw_data_limpio_2.csv: 1614 rows, 37 columns

(1614, 37)